{
	"title": "Unit 11: Domain Science",
	"description": "<p style='color: red; font-weight: bold'>>>>>>  gd2md-html alert:  ERRORs: 0; WARNINGs: 0; ALERTS: 2.</p><ul style='color: red; font-weight: bold'><li>See top comment block for details on ERRORs and WARNINGs. <li>In the converted Markdown or HTML, search for inline alerts that start with >>>>>  gd2md-html alert:  for specific instances that need correction.</ul><p style='color: red; font-weight: bold'>Links to alert messages:</p><a href='#gdcalert1'>alert1</a><a href='#gdcalert2'>alert2</a><p style='color: red; font-weight: bold'>>>>>> PLEASE check and correct alert issues and delete this message and the inline alerts.<hr></p><p>This domain science lesson on astrophysical fluid dynamics is part of the Blue Waters Curriculum Capstone project. In this unit, students will explore numerical simulations at a wide range of physical scales from the scale of atoms and molecules (<p id='gdcalert1' ><span style='color: red; font-weight: bold'>>>>>>  gd2md-html alert: inline image link here (to images/image1.png). Store image on your image server and adjust path/filename/extension if necessary. </span><br>(<a href='#'>Back to top</a>)(<a href='#gdcalert2'>Next alert</a>)<br><span style='color: red; font-weight: bold'>>>>>> </span></p><img src='images/image1.png' width='' alt='alt_text' title='image_tooltip'> m) to Universe-in-a-box simulations on the scale of hundreds of megaparsecs (<p id='gdcalert2' ><span style='color: red; font-weight: bold'>>>>>>  gd2md-html alert: inline image link here (to images/image2.png). Store image on your image server and adjust path/filename/extension if necessary. </span><br>(<a href='#'>Back to top</a>)(<a href='#gdcalert3;>Next alert</a>)<br><span style='color: red; font-weight: bold'>>>>>> </span></p><img src='images/image2.png' width='' alt='alt_text' title='image_tooltip'>m).</p><p>In the rest of this unit, we will focus on fluid dynamics simulations. The PLUTO Code for Astrophysical Gas Dynamics is designed for the numerical solution of mixed hyperbolic and parabolic systems of partial differential equations (conservation laws) targeting high Mach number flows in astrophysical fluid dynamics. Although many of these simulations can be applied to any macroscopic scale, this code is designed to solve problems involving supersonic flows, where the gas or plasma is moving faster than the local sound speed on large physical scales - the scale of stars.</p><p>Astrophysics is the domain science that uses physical principles to determine the physical nature of astronomical objects like stars, galaxies, and other large-scale structures, and to understand time-variable phenomena like supernovae, star and planet formation, stellar evolution, and galaxy evolution. The goal of computational astrophysics is to produce computer simulations to explore the behavior of a mathematical model of a particular system or process in astronomy.</p><p>Each module is divided into a lecture (with one or parts), one or more physical problems to solve, and a set of student activities, that may include student-led discussions. Students complete one or more formative assessments per module, and a summative assessment at the end of the unit. The curriculum provides two sample summative assessments: a set of multiple choice questions, and a summative project activity. </p>"
}