{
  "title": "Unit 11: Domain Science: Astrophysical Fluid Dynamics",
  "description": "",
  "longDescription": "The purpose of the Domain Science Unit is to introduce students to applications of parallel computing in domain sciences. Domain sciences include computer simulation, computational physics, astrophysics, cosmology, biology, chemistry, meteorology, engineering, and applied mathematics. In this unit, students will explore numerical simulations at a wide range of physical scales from the scale of atoms and molecules (10<sup>-10</sup> m) to Universe-in-a-box simulations on the scale of hundreds of megaparsecs (10<sup>25</sup> m). In the rest of this unit, we will focus on fluid dynamics simulations. The PLUTO Code for Astrophysical Gas Dynamics is designed for the numerical solution of mixed hyperbolic and parabolic systems of partial differential equations (conservation laws) targeting high Mach number flows in astrophysical fluid dynamics. Although many of these simulations can be applied to any macroscopic scale, this code is designed to solve problems involving supersonic flows, where the gas or plasma is moving faster than the local sound speed on large physical scales - the scale of stars.

Astrophysics is the domain science that uses physical principles to determine the physical nature of astronomical objects like stars, galaxies, and other large-scale structures, and to understand time-variable phenomena like supernovae, star and planet formation, stellar evolution, and galaxy evolution. The goal of computational astrophysics is to produce computer simulations to explore the behavior of a mathematical model of a particular system or process in astronomy.

Each lesson is divided into a lecture (with one or parts), one or more physical problems to solve, and a set of student activities, that may include student-led discussions. Students complete one or more formative assessments per lesson, and a summative assessment at the end of the unit. The curriculum provides two sample summative assessments: a set of multiple choice questions, and a summative project activity. 
"
}
